Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70b/atdf/ATSAME70J19B.atdf
<?xml version="1.0" encoding="UTF-8"?>
<!--
 Copyright (c) 2017 Microchip Technology Inc.

 SPDX-License-Identifier: Apache-2.0

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.6" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <file timestamp="2018-01-24T14:00:00Z"/>
  <variants>
    <variant ordercode="ATSAME70J19B-AN" package="LQFP64" pinout="LQFP64" speedmax="300" tempmax="+105" tempmin="-40" vccmax="3.6" vccmin="1.62"/>
  </variants>
  <devices>
    <device architecture="CORTEX-M7" family="SAME" name="ATSAME70J19B" series="SAME70">
      <address-spaces>
        <address-space id="base" name="base" endianness="little" size="0x100000000" start="0">
          <memory-segment name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW"/>
          <memory-segment name="SYSTEM" start="0xE0000000" size="0x10000000" type="io" rw="RW"/>
          <memory-segment name="QSPIMEM" start="0x80000000" size="0x20000000" type="other" rw="RW" exec="true"/>
          <memory-segment name="AXIMX" start="0xA0000000" size="0x00100000" type="other" rw="RW"/>
          <memory-segment name="ITCM" start="0x00000000" size="0x00200000" type="other" rw="RW" exec="true"/>
          <memory-segment name="IFLASH" start="0x00400000" size="0x00080000" type="flash" pagesize="512" rw="RW" exec="true"/>
          <memory-segment name="IROM" start="0x00800000" size="0x00004000" type="rom" exec="true"/>
          <memory-segment name="DTCM" start="0x20000000" size="0x00020000" type="other" rw="RW" exec="true"/>
          <memory-segment name="IRAM" start="0x20400000" size="0x00040000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="SDRAM_CS" start="0x70000000" size="0x10000000" type="other" rw="RW" exec="true"/>
        </address-space>
        <address-space id="fuses" name="fuses" endianness="little" size="1" start="0"/>
        <address-space id="lockbits" name="lockbits" endianness="little" size="0x4" start="0"/>
      </address-spaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value="0x05B3D03F"/>
          <property name="CHIPID_CIDR" value="0xA10D0A01"/>
          <property name="CHIPID_EXID" value="0x00000000"/>
        </property-group>
        <property-group name="LEGACY_INSTANCE_IDS">
          <property name="ID_TC0" value="TC0_INSTANCE_ID_CHANNEL0"/>
          <property name="ID_TC1" value="TC0_INSTANCE_ID_CHANNEL1"/>
          <property name="ID_TC2" value="TC0_INSTANCE_ID_CHANNEL2"/>
          <property name="ID_TC3" value="TC1_INSTANCE_ID_CHANNEL0"/>
          <property name="ID_TC4" value="TC1_INSTANCE_ID_CHANNEL1"/>
          <property name="ID_TC5" value="TC1_INSTANCE_ID_CHANNEL2"/>
          <property name="ID_TC6" value="TC2_INSTANCE_ID_CHANNEL0"/>
          <property name="ID_TC7" value="TC2_INSTANCE_ID_CHANNEL1"/>
          <property name="ID_TC8" value="TC2_INSTANCE_ID_CHANNEL2"/>
          <property name="ID_TC9" value="TC3_INSTANCE_ID_CHANNEL0"/>
          <property name="ID_TC10" value="TC3_INSTANCE_ID_CHANNEL1"/>
          <property name="ID_TC11" value="TC3_INSTANCE_ID_CHANNEL2"/>
        </property-group>
        <property-group name="ELECTRICAL_CHARACTERISTICS">
          <property name="CHIP_FREQ_SLCK_RC_MIN" value="20000"/>
          <property name="CHIP_FREQ_SLCK_RC" value="32000" caption="Typical Slow Clock Internal RC frequency"/>
          <property name="CHIP_FREQ_SLCK_RC_MAX" value="44000"/>
          <property name="CHIP_FREQ_MAINCK_RC_4MHZ" value="4000000"/>
          <property name="CHIP_FREQ_MAINCK_RC_8MHZ" value="8000000"/>
          <property name="CHIP_FREQ_MAINCK_RC_12MHZ" value="12000000"/>
          <property name="CHIP_FREQ_CPU_MAX" value="300000000"/>
          <property name="CHIP_FREQ_XTAL_32K" value="32768"/>
          <property name="CHIP_FREQ_XTAL_12M" value="12000000"/>
          <property name="CHIP_FREQ_FWS_0" value="23000000" caption="Maximum operating frequency when FWS is 0"/>
          <property name="CHIP_FREQ_FWS_1" value="46000000" caption="Maximum operating frequency when FWS is 1"/>
          <property name="CHIP_FREQ_FWS_2" value="69000000" caption="Maximum operating frequency when FWS is 2"/>
          <property name="CHIP_FREQ_FWS_3" value="92000000" caption="Maximum operating frequency when FWS is 3"/>
          <property name="CHIP_FREQ_FWS_4" value="115000000" caption="Maximum operating frequency when FWS is 4"/>
          <property name="CHIP_FREQ_FWS_5" value="138000000" caption="Maximum operating frequency when FWS is 5"/>
          <property name="CHIP_FREQ_FWS_6" value="150000000" caption="Maximum operating frequency when FWS is 6"/>
          <property name="CHIP_FREQ_FWS_NUMBER" value="7" caption="Number of FWS ranges"/>
        </property-group>
      </property-groups>
      <parameters>
        <param name="__CM7_REV" value="0x0101" caption="CM7 Core Revision"/>
        <param name="__NVIC_PRIO_BITS" value="3" caption="Number of Bits used for Priority Levels"/>
        <param name="__Vendor_SysTickConfig" value="0" caption="Set to 1 if different SysTick Config is used"/>
        <param name="__MPU_PRESENT" value="1" caption="MPU present or not"/>
        <param name="__VTOR_PRESENT" value="1" caption="Vector Table Offset Register present or not"/>
        <param name="__FPU_PRESENT" value="1" caption="FPU present or not"/>
        <param name="__FPU_DP" value="1" caption="Double Precision FPU"/>
        <param name="__ICACHE_PRESENT" value="1" caption="Instruction Cache present"/>
        <param name="__DCACHE_PRESENT" value="1" caption="Data Cache present"/>
        <param name="__ITCM_PRESENT" value="1" caption="Instruction TCM present"/>
        <param name="__DTCM_PRESENT" value="1" caption="Data TCM present"/>
        <param name="__DEBUG_LVL" value="1"/>
        <param name="__TRACE_LVL" value="1"/>
        <param name="LITTLE_ENDIAN" value="1"/>
        <param name="__ARCH_ARM" value="1"/>
        <param name="__ARCH_ARM_CORTEX_M" value="1"/>
        <param name="__DEVICE_IS_SAM" value="1"/>
      </parameters>
      <peripherals>
        <module name="ACC" id="6490" version="J">
          <instance name="ACC">
            <register-group address-space="base" name="ACC" name-in-module="ACC" offset="0x40044000"/>
            <parameters>
              <param name="INSTANCE_ID" value="33"/>
              <param name="CLOCK_ID" value="33"/>
            </parameters>
          </instance>
        </module>
